label chapter3:
#АКТ 3
#темный экран
"…"
#темный экран
"Яркий луч солнца светил в глаза. Я попытался их открыть, но они словно слиплись."
"Пара усилий, и я поднялся на локтях и проморгался. "
"Всё тело болело. Почему?.."
"Ах да. Я всю ночь проспал на полу. Не очень удобно, надо сказать. "
"Медленно поднявшись, чтобы не потемнело в глазах, я осмотрелся. "
"Проснулся раньше обычного? Или?.."
"Бросившись к столу, я увидел время. 11:34."
"Меня охватила паника. "
"Я опоздал."
"Дзиндзо уже не было в комнате. "
"Он выключил будильник и просто переступил через меня, спавшего на пороге. "
"Это привело меня в ярость. И осознание, что с этим точно необходимо что-то делать!"

"За окном послышался тихий, но настойчивый стук по стеклу."
"Я наспех начал одеваться."
"Погода жаркая, выходной день…"
"Где мои единственные шорты…"
"Стук повторился. К нему прибавились тихие ругательства."
"Половина вещей из шкафа была выкинута мной на пол, но желаемое найти не удалось. "
"Чертыхаясь и обливаясь потом я схватил первое попавшееся."
"Это были шорты, которые я носил ещё в средней школы, в максимально дурацкой расцветке."
"Еле-еле натянув их на себя, я раскрыл шторы и увидел очень злые лица друзей."
k "Бестолочь, ты опять проспал! Ну и видок у тебя. Позорище."
k "Мы ждали тебя полчаса!"
den "Даже я не позволяю себе так опаздывать! Поспать — это святое, но проспать свою жизнь!.."
h "Да, с тобой в разведку не сходишь. Или на рыбалку…"
k "Побежали скорее, мы на великах!"
"Ребята гуськом двинулись вдоль забора к выходу со двора, вскочили на велики и двинулись в сторону парка."
"Я тихо подвывал от обиды и от того, как старые шорты сдавливали мне мои самые лучшие достоинства."
"Велосипед нес меня вдаль, а я лишь шептал:"
t "Он украл не только мою жизнь, но и мои единственные шорты…"

#темный экран
"…"
#темный экран
#Amusement Park.JPG
"Мы прибыли к входу в парк развлечений. "
"Запыхавшиеся, потные и недовольные, мы вбежали внутрь территории."
"Вокруг царила атмосфера непринужденного веселья, летняя и легкая. "
"А также присутствовала определенная толика романтики — ведь что может быть лучше для пары школьников, как совместное посещение аттракционов и мороженое в летнюю знойную жару?.."
"Отогнав лишние мысли, я бросился искать их. "
"И нашел. "
"Мы мгновенно приняли скрытную стойку возле ближайшей палатки с тиром."
"Они сидели у фонтана. Юми, вероятно, натерла ногу в своих красивых босоножках на каблуках, и была расстроена."
"В момент, когда мы их заметили, Дзиндзо не терял времени даром. "
"Он вытащил из рюкзака запас пластырей, которыми я не так давно заклеивал ему палевные болты, и приклеил их ей на ногу."
"Юми засмущалась, но поблагодарила Дзиндзо, и они весело болтали, сидя на бортике фонтана и брызгая друг друга теплой водичкой."
t "Вот бы его короткое замыкание пробрало!.."
t "Я ему щас!!!.."
"Чуть было не сдвинувшись с места в попытке помешать им, я был прижат к стене. "
"Внезапно друзья схватили меня и обездвижили. "
"Кацуми шикнула, чтобы я замолчал."
"Ден и Хикару крепко прижимали моё барахтающееся в ярости тело, пока я не обессилил и не обвис в их объятиях."
"Что ж…"
"Остаток дня нам оставалось лишь наблюдать, как робот гуляет с девушкой, которая мне нравится."

#слайдшоу цг 
"Я потерял всякую мотивацию как-либо влиять на ситуацию."
"Что я мог?.."
#темный экран
"…"

#темный экран
#Amusement Park.JPG
"День подходил к концу. "

"Мы таскались за этой сладкой парочкой около 6 часов. "

"Попутно отбиваясь от фанаток Хикару, которые то и дело преграждали нам путь, пытаясь увести его под ручку или накормить мороженым."

"Что сказать, свидание удалось."

"Мне уже было наплевать. Голову посещали мрачные мысли."

"Друзья сочувствующе смотрели на меня и молчали. "

"Мы сидели на корточках у забора. Из живого здесь была только изгородь, я же ощущал себя совершенно истощенным."

"Дзиндзо и Юми стояли по ту сторону изгороди и не видели нас."

"Расстояние, что нас разделяло, было совсем небольшим, так что мы могли подслушать их разговор."

u "Тайда, спасибо за сегодняшний вечер. Было классно! Мне очень понравилось."

"Юми покрылась густым румянцем."

u "Ты очень милый и хороший."

u "Я рада, что ты позвал меня сегодня."

"Девушка потупила взгляд и стыдливо пинала песок носком босоножки."

u "Вчера, когда ты был у нас в гостях, ты поразил меня."

"Дзиндзо лишь стоял и ласково улыбался девушке."

u "Я знаю тебя давно, но не думала, что ты такой быстрый и ловкий."

"Кацуми шикнула на меня:"

k "Тайда, нельзя больше прятаться, это твой шанс!"

den "Иначе случится непоправимое - они же сейчас поцелуются!"

h "Первый поцелуй не повторишь дважды…"

t "Я понял…"

"Я выскочил из куста прямо перед ними."

"Юми вскрикнула."

"Я был уверен, что в роботическом искусственном взгляде на секунду мелькнул совсем человеческий страх. "

"Дзиндзо двинулся в мою сторону и толкнул меня в попытке спрятать в кустах."

"Но после речи Юми я снова стал полон решимости. Я верну то, что принадлежит мне!"

t "Юми, он — не я! Он не настоящий!.."

t "Всего лишь живая кукла…"

"Дзиндзо сделал ещё одну попытку припрятать меня, но я оказал активное сопротивление."

t "Я больше не намерен скрываться!"

t "Я создал его, чтобы он стал лучшей версией меня."

t "Я не идеален. Более того — много в чём я был плох."

t "Я ленивый. Безответственный."

t "Я раскаиваюсь в том, что сделал правда."

t "Моя жизнь… Я люблю её и не хочу потерять."

t "Я должен был прилагать больше усилий. Теперь я понял, что я представляю из себя, и кем я на самом деле должен быть."

t "Мои друзья, родные, моё будущее, даже школа… Всё это — то, ради чего я существую."

"Я повернулся к Юми, медленно выдохнул и сжал кулаки."

t "Я люблю тебя и не хочу потерять из-за своей же глупости!"
"Все удивленно охнули. Казалось, даже Дзиндзо шире раскрыл глаза от удивления."

"Я чувствовал легкую дрожь в теле и облегчение, что сказал это."

"Лучше сделать и пожалеть, чем всю жизнь жалеть о том, чего не сделал!"

"Юми покрылась густым румянцем."

u "Т-тайда…"

"Мне пришлось перебить её."

t "Я обещаю тебе, ты больше не увидишь старого меня."

"Я показал рукой на Дзиндзо."

t "Ты не заметишь разницы."

t "Я буду таким же заботливым и внимательным. И больше никогда не откажу тебе, когда ты нуждаешься в помощи!" 

t "Обещаю, я стану таким же умным, и добьюсь высот в жизни!"

"Юми улыбнулась и отвела взгляд."

u "Тайда, спасибо…"

u "Дзиндзо и правда очень милый и хороший… Но ты мне нравишься таким, какой ты есть."

u "В-всё хорошо…"

"От её слов дыхание в моей груди перехватило, я не мог шевельнуться."

u "Друзья, простите, мне нужно бежать!.."

"От неловкости ситуации Юми попыталась скрыться, но вспомнила про тележку с игрушками, развернулась, схватила её и сбежала прочь."

"Я выдохнул и прикрыл глаза от облегчения."

"Кажется, я успел всё исправить. Или не всё…"

t "Дзиндзо…"

d "Да, мой господин?"

"Ребята, стоящие рядом, хихикнули."

t "Дзиндзо, пожалуйста, называй меня по имени. Я не господин для тебя."

d "Хорошо, Тайда."

"Я снова собрал всю волю в кулак и посмотрел ему в глаза, моему… Нашему творению."

t "Прости меня."

"Дзиндзо снова вопросительно наклонил голову, что совсем не свойственно для бездушного андроида. И где насмотрелся?"

t "Я был малодушен по отношению к тебе. Это несправедливо."

t "Я создал и использовал тебя для низких целей." 

t "Да, прошло всего ничего времени, но я осознал, что поступил неправильно по отношению к тебе."

t "Я должен был сам бороться с проблемами в своей жизни, а не взваливать их на твои плечи."

"Дзиндзо легко улыбнулся и жестом остановил мою речь."

d "Всё в порядке. Я не обижен. Ведь я не умею обижаться."

d "Примерно представляю, что значит эта эмоция, но испытывать её не могу."

d "Но могу сказать, что был рад помогать тебе с делами, Тайда."

d "Мне лишь нужна цель или задание, ты предоставил мне это, спасибо."

"Я нервно сглотнул и кивнул."

d "Что тебе будет со мной, друзья? Я выполнил свою задачу и больше не нужен?"

"Ребята засмеялись. "

k "Конечно же, нужен, как ты можешь так говорить? Теперь ты наш друг!"

d "Ты очень крутой, чел!"

h "Теперь ты в нашей компании!"

"Инстинктивно поморщившись, я достойно эту принял ситуацию."

"Он — не я, я не — он. "

k "Что ж! Раз все вопросы мы решили, предлагаю всем вместе пойти и покушать тайяки!"

together "\"Дааа!!!~\""

jump epilogue