label chapter3:
#АКТ 3
#темный экран
"…"
#темный экран
t_t "Яркий луч солнца светил в глаза. Я попытался их открыть, но они словно слиплись."
t_t "Пара усилий, и я поднялся на локтях и проморгался. "
t_t "Всё тело болело. Почему?.."
t_t "Ах да. Я всю ночь проспал на полу. Не очень удобно, надо сказать. "
t_t "Медленно поднявшись, чтобы не потемнело в глазах, я осмотрелся. "
t_t "Проснулся раньше обычного? Или?.."
t_t "Бросившись к столу, я увидел время. 11:34."
t_t "Меня охватила паника. "
t_t "Я опоздал."
t_t "Дзиндзо уже не было в комнате. "
t_t "Он выключил будильник и просто переступил через меня, спавшего на пороге. "
t_t "Это привело меня в ярость. И осознание, что с этим точно необходимо что-то делать!"

t_t "За окном послышался тихий, но настойчивый стук по стеклу."
t_t "Я наспех начал одеваться."
t_t "Погода жаркая, выходной день…"
t_t "Где мои единственные шорты…"
t_t "Стук повторился. К нему прибавились тихие ругательства."
t_t "Половина вещей из шкафа была выкинута мной на пол, но желаемое найти не удалось. "
t_t "Чертыхаясь и обливаясь потом, я схватил первое попавшееся."
t_t "Это были шорты, которые я носил ещё в средней школе, в максимально дурацкой расцветке."
t_t "Еле-еле натянув их на себя, я раскрыл шторы и увидел очень злые лица друзей."
k "Бестолочь, ты опять проспал! Ну и видок у тебя. Позорище."
k "Мы ждали тебя полчаса!"
den "Даже я не позволяю себе так опаздывать! Поспать — это святое, но проспать свою жизнь!.."
h "Да, с тобой в разведку не сходишь. Или на рыбалку…"
k "Побежали скорее, мы на великах!"
t_t "Ребята гуськом двинулись вдоль забора к выходу со двора, вскочили на велики и двинулись в сторону парка."
t_t "Я тихо подвывал от обиды и от того, как старые шорты сдавливали мне мои самые лучшие достоинства."
t_t "Велосипед нес меня вдаль, а я лишь шептал:"
t "Он украл не только мою жизнь, но и мои единственные шорты…"

#темный экран
"…"
#темный экран
#Amusement Park.JPG
t_t "Мы прибыли к входу в парк развлечений. "
t_t "Запыхавшиеся, потные и недовольные, мы вбежали внутрь территории."
t_t "Вокруг царила атмосфера непринужденного веселья, летняя и лёгкая. "
t_t "А также присутствовала определенная толика романтики — ведь что может быть лучше для пары школьников, чем совместное посещение аттракционов и мороженое в летнюю знойную жару?.."
t_t "Отогнав лишние мысли, я бросился искать их. "
t_t "И нашел. "
t_t "Мы мгновенно приняли скрытную стойку возле ближайшей палатки с тиром."
t_t "Они сидели у фонтана. Юми, вероятно, натерла ногу в своих красивых босоножках на каблуках, и была расстроена."
t_t "В момент, когда мы их заметили, Дзиндзо не терял времени даром. "
t_t "Он вытащил из рюкзака запас пластырей, которыми я не так давно заклеивал ему палевные болты, и приклеил их ей на ногу."
t_t "Юми засмущалась, но поблагодарила Дзиндзо, и они весело болтали, сидя на бортике фонтана и брызгая друг друга теплой водичкой."
t "Вот бы его короткое замыкание пробрало!.."
t "Я ему щас!!!.."
t_t "Чуть было не сдвинувшись с места в попытке помешать им, я был прижат к стене. "
t_t "Внезапно друзья схватили меня и обездвижили. "
t_t "Кацуми шикнула, чтобы я замолчал."
t_t "Ден и Хикару крепко прижимали моё барахтающееся в ярости тело, пока я не обессилил и не обвис в их объятиях."
t_t "Что ж…"
t_t "Остаток дня нам оставалось лишь наблюдать, как робот гуляет с девушкой, которая мне нравится."

#слайдшоу цг 
t_t "Я потерял всякую мотивацию как-либо влиять на ситуацию."
t_t "Что я мог?.."
#темный экран
"…"

#темный экран
#Amusement Park.JPG
t_t "День подходил к концу. "

t_t "Мы таскались за этой сладкой парочкой около 6 часов. "

t_t "Попутно отбиваясь от фанаток Хикару, которые то и дело преграждали нам путь, пытаясь увести его под ручку или накормить мороженым."

t_t "Что сказать, свидание удалось."

t_t "Мне уже было наплевать. Голову посещали мрачные мысли."

t_t "Друзья сочувствующе смотрели на меня и молчали. "

t_t "Мы сидели на корточках у забора. Из живого здесь была только изгородь, я же ощущал себя совершенно истощенным."

t_t "Дзиндзо и Юми стояли по ту сторону изгороди и не видели нас."

t_t "Расстояние, что нас разделяло, было совсем небольшим, так что мы могли подслушать их разговор."

u "Тайда, спасибо за сегодняшний вечер. Было классно! Мне очень понравилось."

t_t "Юми покрылась густым румянцем."

u "Ты очень милый и хороший."

u "Я рада, что ты позвал меня сегодня."

t_t "Девушка потупила взгляд и стыдливо пинала песок носком босоножки."

u "Вчера, когда ты был у нас в гостях, ты поразил меня."

t_t "Дзиндзо лишь стоял и ласково улыбался девушке."

u "Я знаю тебя давно, но не думала, что ты такой быстрый и ловкий."

t_t "Кацуми шикнула на меня:"

k "Тайда, нельзя больше прятаться, это твой шанс!"

den "Иначе случится непоправимое - они же сейчас поцелуются!"

h "Первый поцелуй не повторишь дважды…"

t "Я понял…"

t_t "Я выскочил из куста прямо перед ними."

t_t "Юми вскрикнула."

t_t "Я был уверен, что в роботическом искусственном взгляде на секунду мелькнул совсем человеческий страх. "

t_t "Дзиндзо двинулся в мою сторону и толкнул меня в попытке спрятать в кустах."

t_t "Но после речи Юми я снова стал полон решимости. Я верну то, что принадлежит мне!"

t "Юми, он — не я! Он не настоящий!.."

t "Всего лишь живая кукла…"

t_t "Дзиндзо сделал ещё одну попытку припрятать меня, но я оказал активное сопротивление."

t "Я больше не намерен скрываться!"

t "Я создал его, чтобы он стал лучшей версией меня."

t "Я не идеален. Более того — много в чём я был плох."

t "Я ленивый. Безответственный."

t "Я раскаиваюсь в том, что сделал, правда."

t "Моя жизнь… Я люблю её и не хочу потерять."

t "Я должен был прилагать больше усилий. Теперь я понял, что я представляю из себя, и кем я на самом деле должен быть."

t "Мои друзья, родные, моё будущее, даже школа… Всё это — то, ради чего я существую."

t_t "Я повернулся к Юми, медленно выдохнул и сжал кулаки."

t "Я люблю тебя и не хочу потерять из-за своей же глупости!"

t_t "Все удивленно охнули. Казалось, даже Дзиндзо шире раскрыл глаза от удивления."

t_t "Я чувствовал легкую дрожь в теле и облегчение, что сказал это."

t_t "Лучше сделать и пожалеть, чем всю жизнь жалеть о том, чего не сделал!"

t_t "Юми покрылась густым румянцем."

u "Т-тайда…"

t_t "Мне пришлось перебить её."

t "Я обещаю тебе, ты больше не увидишь старого меня."

t_t "Я показал рукой на Дзиндзо."

t "Ты не заметишь разницы."

t "Я буду таким же заботливым и внимательным. И больше никогда не откажу тебе, когда ты нуждаешься в помощи!" 

t "Обещаю, я стану таким же умным, и добьюсь высот в жизни!"

t_t "Юми улыбнулась и отвела взгляд."

u "Тайда, спасибо…"

u "Дзиндзо и правда очень милый и хороший… Но ты мне нравишься таким, какой ты есть."

u "В-всё хорошо…"

t_t "От её слов дыхание в моей груди перехватило, я не мог шевельнуться."

u "Друзья, простите, мне нужно бежать!.."

t_t "От неловкости ситуации Юми попыталась скрыться, но вспомнила про тележку с игрушками, развернулась, схватила её и сбежала прочь."

t_t "Я выдохнул и прикрыл глаза от облегчения."

t_t "Кажется, я успел всё исправить. Или не всё…"

t "Дзиндзо…"

d "Да, мой господин?"

t_t "Ребята, стоящие рядом, хихикнули."

t "Дзиндзо, пожалуйста, называй меня по имени. Я не господин для тебя."

d "Хорошо, Тайда."

t_t "Я снова собрал всю волю в кулак и посмотрел ему в глаза, моему… Нашему творению."

t "Прости меня."

t_t "Дзиндзо снова вопросительно наклонил голову, что совсем не свойственно для бездушного андроида. И где насмотрелся?"

t "Я был малодушен по отношению к тебе. Это несправедливо."

t "Я создал и использовал тебя для низких целей." 

t "Да, прошло всего ничего времени, но я осознал, что поступил неправильно по отношению к тебе."

t "Я должен был сам бороться с проблемами в своей жизни, а не взваливать их на твои плечи."

t_t "Дзиндзо легко улыбнулся и жестом остановил мою речь."

d "Всё в порядке. Я не обижен. Ведь я не умею обижаться."

d "Примерно представляю, что значит эта эмоция, но испытывать её не могу."

d "Но могу сказать, что был рад помогать тебе с делами, Тайда."

d "Мне лишь нужна цель или задание, ты предоставил мне это, спасибо."

t_t "Я нервно сглотнул и кивнул."

d "Что тебе будет со мной, друзья? Я выполнил свою задачу и больше не нужен?"

t_t "Ребята засмеялись. "

k "Конечно же, нужен, как ты можешь так говорить? Теперь ты наш друг!"

den "Ты очень крутой, чел!"

h "Теперь ты в нашей компании!"

t_t "Инстинктивно поморщившись, я достойно принял эту ситуацию."

t_t "Он — не я, я не — он. "

k "Что ж! Раз все вопросы мы решили, предлагаю всем вместе пойти и покушать тайяки!"

together "\"Дааа!!!~\""

jump epilogue